app/views/instructions/_form.html.erb

    <div class="controls">
      <%= f.collection_select :program_id, Program.all, :id, :name, :prompt => true %>
---
SELECT "programs".* FROM "programs"