app/views/instructions/show.html.erb

  <b>Program name:</b>
  <% a = Program.find @instruction.program_id %>
---
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", 1]]