app/controllers/instructions_controller.rb

SELECT "instructions".* FROM "instructions"
---
  def index
    @instructions = Instruction.all

SELECT "instructions".* FROM "instructions" WHERE "instructions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "5"]]
---
  def show
    @instruction = Instruction.find(params[:id])
    @program = Program.find(params[:program_id])

SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def new
    @instruction = Instruction.new
    @program = Program.find(params[:program_id])

SELECT "instructions".* FROM "instructions" WHERE "instructions"."id" = ? LIMIT 1  [["id", "7"]]
---
  def edit
    @instruction = Instruction.find(params[:id])

SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "instructions" ("created_at", "description", "name", "step", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 23 Apr 2013 03:36:45 UTC +00:00], ["description", "Do some stuff"], ["name", "Test"], ["step", "1"], ["updated_at", Tue, 23 Apr 2013 03:36:45 UTC +00:00]]
---
  def create
    @instruction = Instruction.new(params[:instruction])
    @program = Program.find(params[:program_id])

    respond_to do |format|
      if @instruction.save

SELECT "instructions".* FROM "instructions" WHERE "instructions"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "instructions" SET "documents" = 'doc 1', "updated_at" = '2013-04-25 00:00:34.148229' WHERE "instructions"."id" = 7
---
  def update
    @instruction = Instruction.find(params[:id])
    @program = Program.find(params[:program_id])

    respond_to do |format|
      if @instruction.update_attributes(params[:instruction])