app/controllers/programs_controller.rb

SELECT "programs".* FROM "programs"
---
  def index
    @programs = Program.all

SELECT "programs".* FROM "programs" WHERE "programs"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @program = Program.find(params[:id])

INSERT INTO "programs" ("created_at", "description", "instruction_id", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 26 Apr 2013 21:00:45 UTC +00:00], ["description", "you know, medical"], ["instruction_id", nil], ["name", "Medical"], ["updated_at", Fri, 26 Apr 2013 21:00:45 UTC +00:00]]
---
  def create
    @program = Program.new(params[:program])

    respond_to do |format|
      if @program.save