app/controllers/static_pages_controller.rb

  def home
  	@instructions = Instruction.all
---
SELECT "instructions".* FROM "instructions"